results/k6-sprint-3-poison-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /workspace/k6/sprint-3-poison.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 1m10s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  0m01.0s/1m10.0s

running (0m02.0s), 02/20 VUs, 2 complete and 0 interrupted iterations
default   [   3% ] 02/20 VUs  0m02.0s/1m10.0s

running (0m03.0s), 02/20 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 02/20 VUs  0m03.0s/1m10.0s

running (0m04.0s), 03/20 VUs, 6 complete and 0 interrupted iterations
default   [   6% ] 03/20 VUs  0m04.0s/1m10.0s

running (0m05.0s), 04/20 VUs, 9 complete and 0 interrupted iterations
default   [   7% ] 04/20 VUs  0m05.0s/1m10.0s

running (0m06.0s), 04/20 VUs, 11 complete and 0 interrupted iterations
default   [   9% ] 04/20 VUs  0m06.0s/1m10.0s

running (0m07.0s), 05/20 VUs, 15 complete and 0 interrupted iterations
default   [  10% ] 05/20 VUs  0m07.0s/1m10.0s

running (0m08.0s), 06/20 VUs, 19 complete and 0 interrupted iterations
default   [  11% ] 06/20 VUs  0m08.0s/1m10.0s

running (0m09.0s), 06/20 VUs, 24 complete and 0 interrupted iterations
default   [  13% ] 06/20 VUs  0m09.0s/1m10.0s

running (0m10.0s), 07/20 VUs, 31 complete and 0 interrupted iterations
default   [  14% ] 07/20 VUs  0m10.0s/1m10.0s

running (0m11.0s), 07/20 VUs, 37 complete and 0 interrupted iterations
default   [  16% ] 07/20 VUs  0m11.0s/1m10.0s

running (0m12.0s), 08/20 VUs, 45 complete and 0 interrupted iterations
default   [  17% ] 08/20 VUs  0m12.0s/1m10.0s

running (0m13.0s), 09/20 VUs, 51 complete and 0 interrupted iterations
default   [  19% ] 09/20 VUs  0m13.0s/1m10.0s

running (0m14.0s), 09/20 VUs, 58 complete and 0 interrupted iterations
default   [  20% ] 09/20 VUs  0m14.0s/1m10.0s

running (0m15.0s), 10/20 VUs, 68 complete and 0 interrupted iterations
default   [  21% ] 10/20 VUs  0m15.0s/1m10.0s

running (0m16.0s), 11/20 VUs, 77 complete and 0 interrupted iterations
default   [  23% ] 11/20 VUs  0m16.0s/1m10.0s

running (0m17.0s), 11/20 VUs, 86 complete and 0 interrupted iterations
default   [  24% ] 11/20 VUs  0m17.0s/1m10.0s

running (0m18.0s), 12/20 VUs, 95 complete and 0 interrupted iterations
default   [  26% ] 12/20 VUs  0m18.0s/1m10.0s

running (0m19.0s), 13/20 VUs, 105 complete and 0 interrupted iterations
default   [  27% ] 13/20 VUs  0m19.0s/1m10.0s

running (0m20.0s), 13/20 VUs, 116 complete and 0 interrupted iterations
default   [  29% ] 13/20 VUs  0m20.0s/1m10.0s

running (0m21.0s), 14/20 VUs, 128 complete and 0 interrupted iterations
default   [  30% ] 14/20 VUs  0m21.0s/1m10.0s

running (0m22.0s), 14/20 VUs, 138 complete and 0 interrupted iterations
default   [  31% ] 14/20 VUs  0m22.0s/1m10.0s

running (0m23.0s), 15/20 VUs, 148 complete and 0 interrupted iterations
default   [  33% ] 15/20 VUs  0m23.0s/1m10.0s

running (0m24.0s), 16/20 VUs, 163 complete and 0 interrupted iterations
default   [  34% ] 16/20 VUs  0m24.0s/1m10.0s

running (0m25.0s), 16/20 VUs, 177 complete and 0 interrupted iterations
default   [  36% ] 16/20 VUs  0m25.0s/1m10.0s

running (0m26.0s), 17/20 VUs, 191 complete and 0 interrupted iterations
default   [  37% ] 17/20 VUs  0m26.0s/1m10.0s

running (0m27.0s), 18/20 VUs, 202 complete and 0 interrupted iterations
default   [  39% ] 18/20 VUs  0m27.0s/1m10.0s

running (0m28.0s), 18/20 VUs, 216 complete and 0 interrupted iterations
default   [  40% ] 18/20 VUs  0m28.0s/1m10.0s

running (0m29.0s), 19/20 VUs, 237 complete and 0 interrupted iterations
default   [  41% ] 19/20 VUs  0m29.0s/1m10.0s

running (0m30.0s), 19/20 VUs, 255 complete and 0 interrupted iterations
default   [  43% ] 19/20 VUs  0m30.0s/1m10.0s

running (0m31.0s), 20/20 VUs, 271 complete and 0 interrupted iterations
default   [  44% ] 20/20 VUs  0m31.0s/1m10.0s

running (0m32.0s), 20/20 VUs, 290 complete and 0 interrupted iterations
default   [  46% ] 20/20 VUs  0m32.0s/1m10.0s

running (0m33.0s), 20/20 VUs, 309 complete and 0 interrupted iterations
default   [  47% ] 20/20 VUs  0m33.0s/1m10.0s

running (0m34.0s), 20/20 VUs, 322 complete and 0 interrupted iterations
default   [  49% ] 20/20 VUs  0m34.0s/1m10.0s

running (0m35.0s), 20/20 VUs, 342 complete and 0 interrupted iterations
default   [  50% ] 20/20 VUs  0m35.0s/1m10.0s

running (0m36.0s), 20/20 VUs, 362 complete and 0 interrupted iterations
default   [  51% ] 20/20 VUs  0m36.0s/1m10.0s

running (0m37.0s), 20/20 VUs, 379 complete and 0 interrupted iterations
default   [  53% ] 20/20 VUs  0m37.0s/1m10.0s

running (0m38.0s), 20/20 VUs, 395 complete and 0 interrupted iterations
default   [  54% ] 20/20 VUs  0m38.0s/1m10.0s

running (0m39.0s), 20/20 VUs, 413 complete and 0 interrupted iterations
default   [  56% ] 20/20 VUs  0m39.0s/1m10.0s

running (0m40.0s), 20/20 VUs, 429 complete and 0 interrupted iterations
default   [  57% ] 20/20 VUs  0m40.0s/1m10.0s

running (0m41.0s), 20/20 VUs, 445 complete and 0 interrupted iterations
default   [  59% ] 20/20 VUs  0m41.0s/1m10.0s

running (0m42.0s), 20/20 VUs, 463 complete and 0 interrupted iterations
default   [  60% ] 20/20 VUs  0m42.0s/1m10.0s

running (0m43.0s), 20/20 VUs, 481 complete and 0 interrupted iterations
default   [  61% ] 20/20 VUs  0m43.0s/1m10.0s

running (0m44.0s), 20/20 VUs, 497 complete and 0 interrupted iterations
default   [  63% ] 20/20 VUs  0m44.0s/1m10.0s

running (0m45.0s), 20/20 VUs, 515 complete and 0 interrupted iterations
default   [  64% ] 20/20 VUs  0m45.0s/1m10.0s

running (0m46.0s), 20/20 VUs, 533 complete and 0 interrupted iterations
default   [  66% ] 20/20 VUs  0m46.0s/1m10.0s

running (0m47.0s), 20/20 VUs, 549 complete and 0 interrupted iterations
default   [  67% ] 20/20 VUs  0m47.0s/1m10.0s

running (0m48.0s), 20/20 VUs, 565 complete and 0 interrupted iterations
default   [  69% ] 20/20 VUs  0m48.0s/1m10.0s

running (0m49.0s), 20/20 VUs, 581 complete and 0 interrupted iterations
default   [  70% ] 20/20 VUs  0m49.0s/1m10.0s

running (0m50.0s), 20/20 VUs, 600 complete and 0 interrupted iterations
default   [  71% ] 20/20 VUs  0m50.0s/1m10.0s

running (0m51.0s), 20/20 VUs, 617 complete and 0 interrupted iterations
default   [  73% ] 20/20 VUs  0m51.0s/1m10.0s

running (0m52.0s), 20/20 VUs, 634 complete and 0 interrupted iterations
default   [  74% ] 20/20 VUs  0m52.0s/1m10.0s

running (0m53.0s), 20/20 VUs, 649 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  0m53.0s/1m10.0s

running (0m54.0s), 20/20 VUs, 671 complete and 0 interrupted iterations
default   [  77% ] 20/20 VUs  0m54.0s/1m10.0s

running (0m55.0s), 20/20 VUs, 686 complete and 0 interrupted iterations
default   [  79% ] 20/20 VUs  0m55.0s/1m10.0s

running (0m56.0s), 20/20 VUs, 702 complete and 0 interrupted iterations
default   [  80% ] 20/20 VUs  0m56.0s/1m10.0s

running (0m57.0s), 20/20 VUs, 718 complete and 0 interrupted iterations
default   [  81% ] 20/20 VUs  0m57.0s/1m10.0s

running (0m58.0s), 20/20 VUs, 736 complete and 0 interrupted iterations
default   [  83% ] 20/20 VUs  0m58.0s/1m10.0s

running (0m59.0s), 20/20 VUs, 760 complete and 0 interrupted iterations
default   [  84% ] 20/20 VUs  0m59.0s/1m10.0s

running (1m00.0s), 20/20 VUs, 775 complete and 0 interrupted iterations
default   [  86% ] 20/20 VUs  1m00.0s/1m10.0s

running (1m01.0s), 19/20 VUs, 791 complete and 0 interrupted iterations
default   [  87% ] 19/20 VUs  1m01.0s/1m10.0s

running (1m02.0s), 17/20 VUs, 810 complete and 0 interrupted iterations
default   [  89% ] 17/20 VUs  1m02.0s/1m10.0s

running (1m03.0s), 15/20 VUs, 826 complete and 0 interrupted iterations
default   [  90% ] 15/20 VUs  1m03.0s/1m10.0s

running (1m04.0s), 13/20 VUs, 839 complete and 0 interrupted iterations
default   [  91% ] 13/20 VUs  1m04.0s/1m10.0s

running (1m05.0s), 13/20 VUs, 847 complete and 0 interrupted iterations
default   [  93% ] 13/20 VUs  1m05.0s/1m10.0s

running (1m06.0s), 09/20 VUs, 861 complete and 0 interrupted iterations
default   [  94% ] 09/20 VUs  1m06.0s/1m10.0s

running (1m07.0s), 08/20 VUs, 869 complete and 0 interrupted iterations
default   [  96% ] 08/20 VUs  1m07.0s/1m10.0s

running (1m08.0s), 05/20 VUs, 875 complete and 0 interrupted iterations
default   [  97% ] 05/20 VUs  1m08.0s/1m10.0s

running (1m09.0s), 04/20 VUs, 880 complete and 0 interrupted iterations
default   [  99% ] 04/20 VUs  1m09.0s/1m10.0s

running (1m10.0s), 01/20 VUs, 884 complete and 0 interrupted iterations
default   [ 100% ] 01/20 VUs  1m10.0s/1m10.0s


  █ TOTAL RESULTS 

    checks_total.......: 1770    25.178071/s
    checks_succeeded...: 100.00% 1770 out of 1770
    checks_failed......: 0.00%   0 out of 1770

    ✓ status is 400
    ✓ response time < 500ms
    ✓ status is 200

    HTTP
    http_req_duration..............: avg=240.84ms min=1.28ms   med=273.09ms max=385.41ms p(90)=278.03ms p(95)=280.26ms
      { expected_response:true }...: avg=274.37ms min=267.78ms med=273.49ms max=385.41ms p(90)=278.77ms p(95)=280.55ms
    http_req_failed................: 12.31% 109 out of 885
    http_reqs......................: 885    12.589035/s

    EXECUTION
    iteration_duration.............: avg=1.14s    min=501.95ms med=1.27s    max=1.38s    p(90)=1.27s    p(95)=1.28s   
    iterations.....................: 885    12.589035/s
    vus............................: 1      min=1          max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 422 kB 6.0 kB/s
    data_sent......................: 348 kB 4.9 kB/s



running (1m10.3s), 00/20 VUs, 885 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  1m10s